test/_legacy/payment-resolver/chargebee/subscriptions/trial-to-active.json

{
  "id": "AzyfbtTbMhiFM51DW",
  "plan_id": "somiibo-premium-monthly-1",
  "plan_quantity": 1,
  "plan_unit_price": 1995,
  "billing_period": 1,
  "billing_period_unit": "month",
  "trial_end": 1682648996,
  "customer_id": "AzyfbtTbMhiFM51DW",
  "plan_amount": 1995,
  "plan_free_quantity": 0,
  "status": "active",
  "trial_start": 1681439396,
  "current_term_start": 1682648996,
  "current_term_end": 1685240996,
  "next_billing_at": 1685240996,
  "created_at": 1681439396,
  "started_at": 1681439396,
  "activated_at": 1682648996,
  "created_from_ip": "127.0.0.1",
  "updated_at": 1682649106,
  "has_scheduled_changes": false,
  "channel": "web",
  "resource_version": 1682649106712,
  "deleted": false,
  "object": "subscription",
  "currency_code": "USD",
  "shipping_address": {
    "first_name": "Test",
    "last_name": "Lastname",
    "line1": "1234 Main Street",
    "city": "Los Angeles",
    "state": "CA",
    "country": "USA",
    "validation_status": "not_validated",
    "object": "shipping_address"
  },
  "due_invoices_count": 0,
  "mrr": 1995,
  "exchange_rate": 1,
  "base_currency_code": "USD",
  "cf_clientorderid": "1681439217235-0805",
  "has_scheduled_advance_invoices": false
}
