test/_legacy/payment-resolver/stripe/subscriptions/trial-to-active.json

{
  "id": "sub_1MqedqJVFkvVyI7hYGbJyOFD",
  "object": "subscription",
  "application": null,
  "application_fee_percent": null,
  "automatic_tax": {
    "enabled": false
  },
  "billing_cycle_anchor": 1681227658,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "cancellation_details": {
    "comment": null,
    "feedback": null,
    "reason": null
  },
  "collection_method": "charge_automatically",
  "created": 1680018058,
  "currency": "usd",
  "current_period_end": 1683819658,
  "current_period_start": 1681227658,
  "customer": "cus_NbsOHpUzeds2VC",
  "days_until_due": null,
  "default_payment_method": "pm_1MqedgJVFkvVyI7hxmu97E0o",
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [{
      "id": "si_NbsOHZzFBCYCAA",
      "object": "subscription_item",
      "billing_thresholds": null,
      "created": 1680018058,
      "metadata": {},
      "plan": {
        "id": "price_1JHS0PJVFkvVyI7hZdX39qjC",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 600,
        "amount_decimal": "600",
        "billing_scheme": "per_unit",
        "created": 1627298997,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": true,
        "metadata": {},
        "nickname": null,
        "product": "prod_JvIbk6zKofew11",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "price": {
        "id": "price_1JHS0PJVFkvVyI7hZdX39qjC",
        "object": "price",
        "active": true,
        "billing_scheme": "per_unit",
        "created": 1627298997,
        "currency": "usd",
        "custom_unit_amount": null,
        "livemode": true,
        "lookup_key": null,
        "metadata": {},
        "nickname": null,
        "product": "prod_JvIbk6zKofew11",
        "recurring": {
          "aggregate_usage": null,
          "interval": "month",
          "interval_count": 1,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "tax_behavior": "unspecified",
        "tiers_mode": null,
        "transform_quantity": null,
        "type": "recurring",
        "unit_amount": 600,
        "unit_amount_decimal": "600"
      },
      "quantity": 1,
      "subscription": "sub_1MqedqJVFkvVyI7hYGbJyOFD",
      "tax_rates": []
    }],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_1MqedqJVFkvVyI7hYGbJyOFD"
  },
  "latest_invoice": {
    "id": "in_1MvjJfJVFkvVyI7hfnTMSPEn",
    "object": "invoice",
    "account_country": "US",
    "account_name": "ITW Creative Works",
    "account_tax_ids": null,
    "amount_due": 600,
    "amount_paid": 600,
    "amount_remaining": 0,
    "amount_shipping": 0,
    "application": null,
    "application_fee_amount": null,
    "attempt_count": 1,
    "attempted": true,
    "auto_advance": false,
    "automatic_tax": {
      "enabled": false,
      "status": null
    },
    "billing_reason": "subscription_cycle",
    "charge": "ch_3MvkIlJVFkvVyI7h1rV2C5x5",
    "collection_method": "charge_automatically",
    "created": 1681227667,
    "currency": "usd",
    "custom_fields": null,
    "customer": "cus_NbsOHpUzeds2VC",
    "customer_address": null,
    "customer_email": "customer@gmail.com",
    "customer_name": null,
    "customer_phone": null,
    "customer_shipping": null,
    "customer_tax_exempt": "none",
    "customer_tax_ids": [],
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "discounts": [],
    "due_date": null,
    "ending_balance": 0,
    "footer": null,
    "from_invoice": null,
    "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1JHRsKJVFkvVyI7h/live_YWNjdF8xSkhSc0tKVkZrdlZ5STdoLF9OaDdZWUlkcWR5bTN6R0tWNzY0WjVlRjdVRmxtSkpsLDczMzIyNjYw0200cfIPOia3?s=ap",
    "invoice_pdf": "https://pay.stripe.com/invoice/acct_1JHRsKJVFkvVyI7h/live_YWNjdF8xSkhSc0tKVkZrdlZ5STdoLF9OaDdZWUlkcWR5bTN6R0tWNzY0WjVlRjdVRmxtSkpsLDczMzIyNjYw0200cfIPOia3/pdf?s=ap",
    "last_finalization_error": null,
    "latest_revision": null,
    "lines": {
      "object": "list",
      "data": [{
        "id": "il_1MvjJfJVFkvVyI7h24vUOw0s",
        "object": "line_item",
        "amount": 600,
        "amount_excluding_tax": 600,
        "currency": "usd",
        "description": "1 × SoundGrail Premium (Monthly) (at $6.00 / month)",
        "discount_amounts": [],
        "discountable": true,
        "discounts": [],
        "livemode": true,
        "metadata": {
          "clientOrderId": "1680009998730-0150"
        },
        "period": {
          "end": 1683819658,
          "start": 1681227658
        },
        "plan": {
          "id": "price_1JHS0PJVFkvVyI7hZdX39qjC",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 600,
          "amount_decimal": "600",
          "billing_scheme": "per_unit",
          "created": 1627298997,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": true,
          "metadata": {},
          "nickname": null,
          "product": "prod_JvIbk6zKofew11",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_1JHS0PJVFkvVyI7hZdX39qjC",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1627298997,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": true,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_JvIbk6zKofew11",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "unspecified",
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 600,
          "unit_amount_decimal": "600"
        },
        "proration": false,
        "proration_details": {
          "credited_items": null
        },
        "quantity": 1,
        "subscription": "sub_1MqedqJVFkvVyI7hYGbJyOFD",
        "subscription_item": "si_NbsOHZzFBCYCAA",
        "tax_amounts": [],
        "tax_rates": [],
        "type": "subscription",
        "unit_amount_excluding_tax": "600"
      }],
      "has_more": false,
      "total_count": 1,
      "url": "/v1/invoices/in_1MvjJfJVFkvVyI7hfnTMSPEn/lines"
    },
    "livemode": true,
    "metadata": {},
    "next_payment_attempt": null,
    "number": "581AEFFB-0002",
    "on_behalf_of": null,
    "paid": true,
    "paid_out_of_band": false,
    "payment_intent": "pi_3MvkIlJVFkvVyI7h1Y1uuoUm",
    "payment_settings": {
      "default_mandate": null,
      "payment_method_options": null,
      "payment_method_types": null
    },
    "period_end": 1681227658,
    "period_start": 1680018058,
    "post_payment_credit_notes_amount": 0,
    "pre_payment_credit_notes_amount": 0,
    "quote": null,
    "receipt_number": null,
    "rendering_options": null,
    "shipping_cost": null,
    "shipping_details": null,
    "starting_balance": 0,
    "statement_descriptor": null,
    "status": "paid",
    "status_transitions": {
      "finalized_at": 1681231455,
      "marked_uncollectible_at": null,
      "paid_at": 1681231455,
      "voided_at": null
    },
    "subscription": "sub_1MqedqJVFkvVyI7hYGbJyOFD",
    "subtotal": 600,
    "subtotal_excluding_tax": 600,
    "tax": null,
    "test_clock": null,
    "total": 600,
    "total_discount_amounts": [],
    "total_excluding_tax": 600,
    "total_tax_amounts": [],
    "transfer_data": null,
    "webhooks_delivered_at": 1681227667
  },
  "livemode": true,
  "metadata": {
    "clientOrderId": "1680009998730-0150"
  },
  "next_pending_invoice_item_invoice": null,
  "on_behalf_of": null,
  "pause_collection": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null,
    "save_default_payment_method": "off"
  },
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "id": "price_1JHS0PJVFkvVyI7hZdX39qjC",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 600,
    "amount_decimal": "600",
    "billing_scheme": "per_unit",
    "created": 1627298997,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": true,
    "metadata": {},
    "nickname": null,
    "product": "prod_JvIbk6zKofew11",
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start_date": 1680018058,
  "status": "active",
  "test_clock": null,
  "transfer_data": null,
  "trial_end": 1681227658,
  "trial_settings": {
    "end_behavior": {
      "missing_payment_method": "pause"
    }
  },
  "trial_start": 1680018058
}
