test/payment-resolver/paypal/subscriptions/trial-to-active.json

{
    "status": "ACTIVE",
    "status_update_time": "2023-04-25T10:28:23Z",
    "id": "I-VTXGPKDTMMK2",
    "plan_id": "P-4BD44825TA6880346MQN5VYI",
    "start_time": "2023-04-11T17:37:58Z",
    "quantity": "1",
    "shipping_amount": {
        "currency_code": "USD",
        "value": "0.0"
    },
    "subscriber": {
        "email_address": "customer@gmail.com",
        "payer_id": "3EDSAYMN2UELJ",
        "name": {
            "given_name": "Test",
            "surname": "Lastname"
        }
    },
    "billing_info": {
        "outstanding_balance": {
            "currency_code": "USD",
            "value": "0.0"
        },
        "cycle_executions": [
            {
                "tenure_type": "TRIAL",
                "sequence": 1,
                "cycles_completed": 1,
                "cycles_remaining": 0,
                "current_pricing_scheme_version": 1,
                "total_cycles": 1
            },
            {
                "tenure_type": "REGULAR",
                "sequence": 2,
                "cycles_completed": 1,
                "cycles_remaining": 0,
                "current_pricing_scheme_version": 1,
                "total_cycles": 0
            }
        ],
        "last_payment": {
            "amount": {
                "currency_code": "USD",
                "value": "19.95"
            },
            "time": "2023-04-25T10:28:22Z"
        },
        "next_billing_time": "2023-05-25T10:00:00Z",
        "failed_payments_count": 0
    },
    "create_time": "2023-04-11T17:41:24Z",
    "update_time": "2023-04-25T10:28:23Z",
    "custom_id": "1681234666743-0811",
    "plan_overridden": true,
    "plan": {
        "product_id": "somiibo-premium-1",
        "name": "Somiibo Premium (Monthly)",
        "description": "A free social media automation platform that organically grows your online presence and gets you more followers.",
        "billing_cycles": [
            {
                "pricing_scheme": {
                    "fixed_price": {
                        "currency_code": "USD",
                        "value": "9.97"
                    }
                },
                "frequency": {
                    "interval_unit": "DAY",
                    "interval_count": 14
                },
                "tenure_type": "TRIAL",
                "sequence": 1,
                "total_cycles": 1
            },
            {
                "pricing_scheme": {
                    "fixed_price": {
                        "currency_code": "USD",
                        "value": "19.95"
                    }
                },
                "frequency": {
                    "interval_unit": "MONTH",
                    "interval_count": 1
                },
                "tenure_type": "REGULAR",
                "sequence": 2,
                "total_cycles": 0
            }
        ],
        "payment_preferences": {
            "service_type": "PREPAID",
            "auto_bill_outstanding": true,
            "setup_fee": {
                "currency_code": "USD",
                "value": "0.0"
            },
            "setup_fee_failure_action": "CANCEL",
            "payment_failure_threshold": 0
        },
        "quantity_supported": true
    },
    "links": [
        {
            "href": "https://api.paypal.com/v1/billing/subscriptions/I-VTXGPKDTMMK2/cancel",
            "rel": "cancel",
            "method": "POST"
        },
        {
            "href": "https://api.paypal.com/v1/billing/subscriptions/I-VTXGPKDTMMK2",
            "rel": "edit",
            "method": "PATCH"
        },
        {
            "href": "https://api.paypal.com/v1/billing/subscriptions/I-VTXGPKDTMMK2?fields=plan",
            "rel": "self",
            "method": "GET"
        },
        {
            "href": "https://api.paypal.com/v1/billing/subscriptions/I-VTXGPKDTMMK2/suspend",
            "rel": "suspend",
            "method": "POST"
        },
        {
            "href": "https://api.paypal.com/v1/billing/subscriptions/I-VTXGPKDTMMK2/capture",
            "rel": "capture",
            "method": "POST"
        }
    ]
}
